{"config": {"name": "sequential_11", "layers": [{"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_66", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 64, "activation": "linear", "batch_input_shape": [null, 128], "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_51", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_48", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_67", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 32, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_52", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_49", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_68", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 16, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_53", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_50", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_69", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 10, "activation": "sigmoid", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}