{"config": {"name": "sequential_10", "layers": [{"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_62", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 16, "activation": "linear", "batch_input_shape": [null, 10], "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_47", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_44", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_63", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 32, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_48", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_45", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_64", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 64, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_49", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_46", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_65", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 128, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"center": true, "dtype": "float32", "scale": true, "trainable": true, "name": "batch_normalization_50", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_47", "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}