{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "sigmoid", "batch_input_shape": [null, 128], "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "units": 10, "activity_regularizer": null, "name": "dense_47", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null}}], "name": "sequential_15"}}