{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "linear", "batch_input_shape": [null, 10], "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "units": 128, "activity_regularizer": null, "name": "dense_46", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "center": true, "name": "batch_normalization_47", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": [1], "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_43", "dtype": "float32"}}], "name": "sequential_14"}}